/*
 * Lha File strings
 */

/* WZAS_LHA_ARCHIVE_EMPTY_NOTHING_TO_EXTRACT */     "3000" = "The archive is empty.  Nothing to extract." ;
/* WZAS_LHA_NO_MATCHING_FILES_NOTHING_TO_EXTRACT */ "3001" = "There are no matching files in the archive.  Nothing to extract." ;
/* WZAS_LHA_EXTRACTING */                           "3002" = "Extracting %1%" ;
/* WZAS_LHA_EXTRACT_OK */                           "3003" = "Extracting %1%\tOK" ;
/* WZAS_LHA_TESTING */                              "3004" = "Testing %1%" ;
/* WZAS_LHA_TESTING_OK */                           "3006" = "Testing %1%\tOK" ;
/* WZAS_LHA_ABORT */                                "3007" = "%1% \tInterrupted" ;
/* WZAS_LHA_BAD_DATA */                             "3008" = "%1% \tData error" ;
/* WZAS_LHA_BAD_ARCHIVE */                          "3009" = "Error: \"%1%\" is not a valid LZH file" ;
/* WZAS_LHA_ERR_OPEN */                             "3010" = "Error: Unable to open \"%1%\"" ;
/* WZAS_LHA_DISK_FULL */                            "3011" = "%1% \tDisk full or write error" ;
/* WZAS_LHA_CREATE_DIR */                           "3012" = "%1% \tUnable to create folder" ;
/* WZAS_LHA_CREATE_FILE */                          "3013" = "%1% \tUnable to create file" ;
/* WZAS_LHA_NO_EXTRACT_DEST_PATH */                 "3014" = "Error: No extract destination path specified" ;
/* WZAS_LHA_OVERWRITE_ALL_NONE */                   "3015" = "Error: Extract \"Overwrite All\" option is incompatible with \"Overwrite None\"" ;
/* WZAS_LHA_READONLY_ARCHIVE */                     "3016" = "Error: Archive \"%1%\" is read-only and cannot be modified" ;
/* WZAS_LHA_ERR_UPDATE_ARCHIVE */                   "3017" = "Error: Unable to update \"%1%\"" ;
/* WZAS_LHA_SEARCHING */                            "3018" = "Searching..." ;
/* WZAS_LHA_DELETING */                             "3019" = "Deleting" ;
/* WZAS_LHA_MOVING */                               "3020" = "Moving Files..." ;
/* WZAS_LHA_ADDING_FILE */                          "3021" = "Adding %1%" ;
/* WZAS_LHA_DELETING_FILE */                        "3022" = "Deleting %1%" ;
/* WZAS_LHA_REPLACING */                            "3023" = "Replacing original archive" ;
/* WZAS_LHA_CANT_REPLACE */                         "3024" = "New archive left as \"%1%\"" ;
/* WZAS_LHA_CANT_ACCESS */                          "3025" = "Warning: \"%1%\" not added; unable to access" ;
/* WZAS_LHA_NO_CONVERSION */                        "3026" = "Warning: \"%1%\" not added; filename incompatible with locale" ;
/* WZAS_LHA_NAME_TOO_LONG */                        "3027" = "Warning: \"%1%\" not added; pathname too long" ;
/* WZAS_LHA_FILE_TOO_BIG */                         "3028" = "Warning: \"%1%\" not added; file is greater than 4 gigabytes" ;
/* WZAS_LHA_CANT_REMOVE_DIRECTORY_WARN */           "3029" = "Unable to remove directory \"%1%\"" ;
/* WZAS_LHA_CANT_REMOVE_FILE_WARN */                "3030" = "Unable to remove file \"%1%\"" ;
/* WZAS_LHA_INTERRUPTED */                          "3031" = "Interrupted" ;
/* WZAS_LHAERR_MISC */                              "3032" = "Error: internal error processing archive" ;
/* WZAS_LHAERR_OPEN */                              "3033" = "Error: unable to open \"%1%\"" ;
/* WZAS_LHAERR_NOTHING_DONE */                      "3034" = "Error: no files found; nothing to do" ;
/* WZAS_LHAERR_DISKFULL */                          "3035" = "Error: disk full or write error" ;
/* WZAS_LHAERR_REPLACE */                           "3036" = "Error: unable to replace original archive" ;
/* WZAS_LHAERR_PATH_TOO_LONG */                     "3037" = "Error: pathname too long" ;
/* WZAS_LHAERR_READONLY */                          "3038" = "Error: archive \"%1%\" is read-only and cannot be modified" ;
/* WZAS_LHAERR_UPDATE */                            "3039" = "Error: unable to update \"%1%\"" ;

/*
 * End of Lha File strings
 */

/*
 * 7z File strings
 */

/* WZAS_7Z_STR_EXTRACTING */                            "6000" = "Extracting %ls" ;
/* WZAS_7Z_STR_TESTING */                               "6001" = "Testing %ls" ;
/* WZAS_7Z_MSG_ARCHIVE_MUST_BE_LOADED_FOR_EXTRACT */    "6002" = "The archive has not been loaded. Nothing to extract." ;
/* WZAS_7Z_MSG_ARCHIVE_EMPTY_NOTHING_TO_EXTRACT */      "6003" = "The archive is empty. Nothing to extract." ;
/* WZAS_7Z_MSG_EXTRACTING */                            "6004" = "Extracting %1%" ;
/* WZAS_7Z_MSG_ARCHIVE_MUST_BE_LOADED_FOR_TEST */       "6005" = "The archive has not been loaded. Nothing to test." ;
/* WZAS_7Z_MSG_ARCHIVE_EMPTY_NOTHING_TO_TEST */         "6006" = "The archive is empty. Nothing to test." ;
/* WZAS_7Z_MSG_TESTING */                               "6007" = "Testing %1%" ;
/* WZAS_7Z_MSG_INTERRUPTED */                           "6008" = "Interrupted" ;
/* WZAS_7Z_MSG_EXTRACTSTART */                          "6008" = "Extracting ..." ;
/* WZAS_7Z_MSG_TESTSTART */                             "6010" = "Testing ..." ;
/* WZAS_7Z_MSG_OK */                                    "6011" = "%1%\tOK" ;
/* WZAS_7Z_MSG_CREATE_DIR */                            "6012" = "%1%\tUnable to create folder" ;
/* WZAS_7Z_MSG_CREATE_FILE */                           "6013" = "%1%\tUnable to create file" ;
/* WZAS_7Z_MSG_UNKN_METHOD */                           "6014" = "%1%\tUnknown compression method" ;
/* WZAS_7Z_MSG_CRC */                                   "6015" = "%1%\tCRC check failed" ;
/* WZAS_7Z_MSG_BAD_DATA */                              "6016" = "%1%\tData error" ;
/* WZAS_7Z_MSG_CRC_CRYPT */                             "6017" = "%1%\tCRC check failed - possible wrong password" ;
/* WZAS_7Z_MSG_BAD_DATA_CRYPT */                        "6018" = "%1%\tData error - possible wrong password" ;
/* WZAS_7Z_MSG_UNKN_ERROR */                            "6019" = "%1%\tUnknown error" ;
/* WZAS_7Z_MSG_BLOCKED */                               "6020" = "%1%\tBlocked by Windows" ;
/* WZAS_7Z_MSG_ABORT */                                 "6021" = "%1%\tInterrupted" ;

/*
 * End of 7z File strings
 */

/*
 * RAR File strings
*/

/* WZAS_RAR_ARCHIVE_MUST_BE_LOADED_FOR_EXTRACT */   "2000" = "The archive has not been loaded.  Nothing to extract." ;
/* WZAS_RAR_ARCHIVE_EMPTY_NOTHING_TO_EXTRACT */     "2001" = "The archive is empty.  Nothing to extract." ;
/* WZAS_RAR_NO_MATCHING_FILES_NOTHING_TO_EXTRACT */ "2002" = "There are no matching files in the archive.  Nothing to extract." ;
/* WZAS_RAR_EXTRACTING */                           "2003" = "Extracting %1%" ;
/* WZAS_RAR_EXTRACT_OK */                           "2004" = "Extracting %1%\tOK" ;
/* WZAS_RAR_INSERT */                               "2005" = "insert" ;
/* WZAS_RAR_DISK_SWAP_CAPTION */                    "2006" = "Please insert disk";
/* WZAS_RAR_DISK_SWAP_DRIVE */                      "2007" = "Please insert the disk containing \"%1%\" into drive %2%" ;
/* WZAS_RAR_DISK_SWAP */                            "2008" = "Please insert the disk containing %1%" ;
/* WZAS_RAR_ARCHIVE_MUST_BE_LOADED_FOR_TEST */      "2009" = "The archive has not been loaded.  Nothing to test." ;
/* WZAS_RAR_ARCHIVE_EMPTY_NOTHING_TO_TEST */        "2010" = "The archive is empty.  Nothing to test." ;
/* WZAS_RAR_TESTING */                              "2011" = "Testing %1%" ;
/* WZAS_RAR_TESTING_OK */                           "2012" = "Testing %1%\tOK" ;
/* WZAS_RAR_ERR_ABORT */                            "2013" = "Interrupted" ;
/* WZAS_RAR_ERR_NO_MEMORY */                        "2014" = "Error: Not enough memory to process \"%1%\"" ;
/* WZAS_RAR_ERR_BAD_HEADER_ENCRYPTED */             "2015" = "Error: Unable to process the headers in the archive \"%1%\" - possible wrong/missing password" ;
/* WZAS_RAR_ERR_BAD_HEADER */                       "2016" = "Error: Unable to process the headers in the archive \"%1%\"" ;
/* WZAS_RAR_ERR_BAD_DATA_ENCRYPTED */               "2017" = "Error: Bad data in file \"%1%\" in the archive \"%2%\" - possible wrong/missing password" ;
/* WZAS_RAR_ERR_BAD_DATA */                         "2018" = "Error: Bad data in file \"%1%\" in the archive \"%2%\"" ;
/* WZAS_RAR_ERR_CRC_ENCRYPTED */                    "2019" = "Error: CRC mismatch in file \"%1%\" in the archive \"%2%\" - possible wrong/missing password" ;
/* WZAS_RAR_ERR_CRC */                              "2020" = "Error: CRC mismatch in file \"%1%\" in the archive \"%2%\"" ;
/* WZAS_RAR_ERR_BAD_ARCHIVE */                      "2021" = "Error: \"%1%\" is not a valid RAR file" ;
/* WZAS_RAR_ERR_UNKNOWN_ARCHIVE */                  "2022" = "Error: Unknown archive format.  Unable to process \"%%1\"" ;
/* WZAS_RAR_ERR_UNKNOWN_FORMAT */                   "2023" = "Error: Unknown encryption used for archive headers.  Unable to process \"%1%\"" ;
/* WZAS_RAR_ERR_OPEN */                             "2024" = "Error: Unable to open \"%1%\"" ;
/* WZAS_RAR_ERR_CREATE */                           "2025" = "Error: Unable to create output file \"%1%\"" ;
/* WZAS_RAR_ERR_CLOSE */                            "2026" = "Error: Unable to close file" ;
/* WZAS_RAR_ERR_READ */                             "2027" = "Error: Unable to read from \"%1%\"" ;
/* WZAS_RAR_ERR_WRITE */                            "2028" = "Error: Unable to write to output file" ;
/* WZAS_RAR_ERR_MISSING_PASSWORD */                 "2029" = "Error: File \"%1%\" not decrypted, no password supplied" ;
/* WZAS_RAR_ERR_UNKNOWN */                          "2030" = "Error: Internal error processing RAR file" ;
/* WZAS_RAR_NO_EXTRACT_DEST_PATH */                 "2031" = "Error: No extract destination path specified" ;
/* WZAS_RAR_ERR_OPEN_FILE*/                         "2032" = "Unable to open this file." ;

/*
 * End of Rar File strings
 */

/*
 * ZipFile strings
 */

/* WZAS_UNEXPECTED_DRIVE_LABEL */       "501" = "The diskette in drive %1% is labeled \"%2%\", WinZip expected \"%3%\".\n\n Do you want to use it anyway?" ;
/* WZAS_WINZIP */                       "502" = "WinZip" ;
/* WZAS_SEEKMSG */                      "503" = "Severe Error [%1%]:  When testing/extracting WinZip was unable to read file %2% in the Zip file\nPossible cause: file transfer error\n" ;
/* WZAS_NEED_LAST_DISKETTE */           "505" = "The disk in drive %1% is the first disk of a spanned Zip file set.\n\nPlease insert the last disk of the spanned set into the drive and click on OK." ;
/* WZAS_WANT_LAST_DISKETTE */           "504" = "The disk in drive %1% does not contain a complete Zip file.\n\nIf it is part of a spanned Zip file set, please insert the last disk of the set into the drive and click on OK; otherwise click on Cancel." ;
/* WZAS_COMPUTING_CRC */                "506" = "Computing CRC: %1% percent complete" ;
/* WZAS_WIPEERROR */                    "507" = "WinZip is unable to erase file(s) [%1%] on the diskette in drive %2%. Click on OK to continue, or Cancel if you wish to abort.";
/* WZAS_REMOVING_DIR */                 "508" = "Removing: %1%" ;
/* WZAS_ERASING_FILE */                 "509" = "Erasing: %1%" ;
/* WZAS_FILESONDISKETTE */              "510" = "All files on the diskette in drive %1% will be lost.\n\nClick on Ignore to continue with the current diskette anyway, click on Abort to end the current zip operation immediately, or insert a new diskette and click on Retry." ;

/* WZAS_NOFLOPPYINDRIVEPROMPT */        "511" = "There is no floppy in drive %1%. Either insert a new diskette then click on OK or click on Cancel to abort the zip operation." ;
/* WZAS_NEXTPARTAPPEARSSAME */          "512" = "The next part of this archive [%1%] in the location you specified [%1%] does not appear to be different from the last part that was processed. Use it anyway?" ;
/* WZAS_INVALID_FILENAME */             "513" = "Unable to open \"%1%\". The filename is invalid.\n" ;
/* WZAS_DEVICE_NOT_READY */             "514" = "Unable to open \"%1%\". The device is not ready.\n" ;
/* WZAS_SPANNINGANDREMOTEDRIVE */       "515" = "Spanned Zip files can only be created on local drives that support removable media" ;
/* WZAS_SPANNINGREQUIRESREMOVABLEDRIVE */   "516" = "Spanned Zip files can only be created on drives that support removable media" ;
/* WZAS_UNABLETOOPENFILEFOROUTPUT */        "517" = "Unable to open \"%1%\" for output" ;
/* WZAS_COULDNOTDELETE */               "518" = "Could not delete \"%1%\"" ;
/* WZAS_COULDNOTRENAME */               "519" = "rename \"%1%\" to \"%2%\" failed" ;
/* WZAS_VOLUMEZNNCOMPLETE */            "520" = "Volume %1% complete" ;

/* WZAS_ZE_SEEKERR */                   "521" = "Unrecoverable seek error in output file" ;
/* WZAS_PARTINNEWLOCATION */            "522" = "Next volume (part %1%) started in new location: %1%" ;
/* WZAS_INSERTDISKETTE */               "523" = "Please insert disk %1% in drive %2%." ;
/* WZAS_CANNOTWIPEDISK */               "524" = "Please insert another diskette for use as disk %1% in drive %2%" ;
/* WZAS_CANNOTWRITETODISK */            "525" = "Cannot write to disk.  Please insert another diskette for use as disk %1% in drive %2%" ;
/* WZAS_DISKAPPEARSTOBEPARTOFBACKUPSET */   "526" = "This disk already contains %1%.  Please insert another diskette." ;
/* WZAS_ERASE_FILES_ON_FIRST_DISKETTE */    "527" = "WinZip is about to create a Zip file on removable disk %1% labeled %2%" ;
/* WZAS_READERROR */                    "529" = "Error [%1%]: unrecoverable Zip file read error\n" ;
/* WZAS_CENTDIRENDSIGNOTFOUND */        "528" = "This file appears to be incomplete or it constitutes one disc of a spanned Zip file. Please insert the last disc of the spanned set and try the operation again.\n" ;
/* WZAS_SKIPPING_UNSUPPORTED_ENCRYPTION_INFO */     "530" = "skipping %1%: this file is encrypted using an unsupported encryption method: %2%%3%-%4%.\n   Please visit www.winzip.com/wz64.htm for more information.\n" ;

/* WZAS_SKIPPING_UNSUPPORTED_ENCRYPTION */          "531" = "skipping %1%: this file is encrypted using an unsupported encryption method.\n   Please visit www.winzip.com/wz64.htm for more information.\n" ;
/* WZAS_UNSUPPORTED_COMPRESSION */                  "532" = "skipping %1%: this file was compressed using an unknown compression method.\n   Please visit www.winzip.com/wz54.htm for more information.\n   The compression method used for this file is %2%.\n" ;
/* WZAS_SKIPPING_LABEL_ONLY_FLOPPY */               "533" = "Skipping Volume Label: %1% - Only local floppy drives can be labeled" ;
/* WZAS_SKIPPING_LABEL */                   "534" = "Skipping Volume Label: %1%" ;
/* WZAS_SKIPPING_UNSUPPORTED_VMS_VERSION */         "535" = "skipping: %1%  this file is not in the standard Zip 2.0 format.\n   Please see www.winzip.com/zip2.htm for more information.\n   VMS unzip version %2%.%3% is required to extract this file.\n   WinZip currently supports up to VMS unzip version %4%.%5%.\n" ;
/* WZAS_SKIPPING_UNSUPPORTED_VERSION_NEEDED */      "536" = "skipping: %1%  this file is not in the standard Zip 2.0 format.\n   Please see www.winzip.com/zip2.htm for more information.\n   Version needed value for this file is %2%.\n   Compression method value is %3%.\n" ;
/* WZAS_INCORRECTPASSWORD */                "537" = "   skipping %1% -- the password is incorrect\n" ;
/* WZAS_NOCRYPTDLL */                       "538" = "Warning: skipping \"%1%\". The necessary CryptoAPI DLLs are not installed on this PC.\n" ;
/* WZAS_NOCRYPTPROV */                      "539" = "Warning: skipping \"%1%\". The necessary CryptoAPI provider is not installed on this PC.\n" ;
/* WZAS_BADENCRYPTIONHEADER */              "540" = "   skipping %1%: The encryption header is either corrupt or not supported by this version of WinZip.\n" ;

/* WZAS_CONTINUEWITHNEXTFILE */             "541" = "Would you like WinZip to try to continue with the next file?" ;
/* WZAS_MAPNAMECONVERSIONOFSFAILEDN */      "542" = "skipping file:  unable to create a sensible filename out of %1%\n" ;
/* WZAS_CREATING_DIRECTORY */               "543" = "   creating directory: %1%\n" ;
/* WZAS_LABELLINGSSN */                     "544" = "labeling %1% %2%\n" ;
/* WZAS_MAPNAMEERRORSETTINGVOLUMELABELN */      "545" = "mapname:  error setting volume label\n" ;
/* WZAS_OVERWRITENONE */                        "546" = "   skipping %1% -- already exists\n" ;
/* WZAS_OLDERFILESKIPPING */                "547" = "   skipping %1% -- no update needed\n" ;
/* WZAS_SETFILETIMEFAILED */                "548" = "*** Unable to set the file\'s timestamp(%1%)\n" ;
/* WZAS_NWARNINGDCOULDNOTSETDIRATTRIBUTESN */   "549" = "Warning (%1%): could not set attributes for directory\n" ;
/* WZAS_LOCALTIMEFAILED */                  "550" = "LocalFileTime failed: %1%\n" ;

/* WZAS_ASK_FOR_DESTROY */                  "551" = "WinZip was able to extract only part of the file %1%\nbecause it contains invalid or missing data.\nWould you like to keep the partial file?\n(Note the partial file will be named %2%)" ;
/* WZAS_SIZE_MISMATCH */                    "552" = "Unable to extract \"%1%\".\n\nThe size of the extracted file (%2%) does not match the uncompressed size (%3%) recorded in the Zip file\n" ;
/* WZAS_SKIPPINGDOTDOT */                   "553" = "info:  skipping suspicious file with parent folder reference: %1%\n" ;
/* WZAS_SKIPPINGREADONLY */                 "554" = "info:  skipping read only, system, or hidden file %1%\n" ;
/* WZAS_WRITINGDOTDOT */                    "555" = "info:  extracting suspicious file with parent folder reference: %1%\n" ;
/* WZAS_OVERWRITINGREADONLY */              "556" = "info:  overwriting read only, system, or hidden file %1%\n" ;
/* WZAS_CANNOT_CREATE_ADMIN */              "557" = "%1% Cannot create %2%.\nAdministrative privileges may be required.\n" ;
/* WZAS_CANNOTCREATEFILE */                 "558" = "%1% Cannot create %2%" ;
/* WZAS_SKIPPING_SPECIAL_DEVICE */          "559" = "Warning: skipping \"%1%\". The filename refers to a special device, typically an LPT device or a console\n" ;
/* WZAS_SKIPPING_PIPE */                    "560" = "Warning: skipping \"%1%\". The filename refers to a pipe not a file\n" ;

/* WZAS_SKIPPING_UNKNOWN_DEVICE */          "561" = "Warning: skipping \"%1%\" because it is located on a device type that is unknown to Windows.\n\nIf you feel that this is incorrect, please contact WinZip\'s technical support (support@winzip.com), specifying the filename and device.\n" ;
/* WZAS_CHECKDIRERRORPATHTOOLONGSN */       "562" = "The path is too long. Unable to extract %1%\n" ;
/* WZAS_UNABLE_TO_PROCESS */                "563" = "Unable to process %1%\n" ;
/* WZAS_CHECKDIRERRORSEXISTSBUTISNOTDIRECTORY */        "564" = "%1% exists but is not directory\n     unable to process %2%.\n" ;
/* WZAS_FILENAME_TOO_LONG */                "565" = "The filename is too long. Unable to extract %1%\n" ;
/* WZAS_UNABLE_TO_MAKE_DIRECTORY */         "566" = "%1%Unable to create directory: %2%\n" ;
/* WZAS_ZIP_FILE_IS_FOLDER */               "567" = "Unable to load %1%. It already exists as a folder.\n" ;
/* WZAS_ZIP_FILE_IS_EMPTY */                "568" = "The Zip file (%1%) is empty. Nothing to load.\n" ;
/* WZAS_MAYBE_APP */                        "569" = "Note: %1% may be a plain executable, not an Zip file\n" ;
/* WZAS_CANTOPENZIPFILE */                  "570" = "Error: cannot open Zip file %1%.\nProbable cause: file doesn\'t exist or file sharing or file permissions problem\n" ;

/* WZAS_CANT_SEEK_TO_CDIR */                "571" = "Error: unable to seek to beginning of central directory" ;
/* WZAS_TOO_MANY_CDIR_ENTRIES */            "572" = "Error: too many entries in central directory according to end of central directory info" ;
/* WZAS_CDIR_NOT_FOUND */                   "573" = "Error: central directory not found" ;
/* WZAS_CDIR_ENTRY_NOT_FOUND */             "574" = "Error: central directory entry no. %1% not found" ;
/* WZAS_UNEXPECTED_EOF_CDIR */              "575" = "Error: unexpected end of file while processing central directory" ;
/* WZAS_INVALID_CDIR_ENTRY */               "576" = "Error: invalid central directory entry (No. %1%) encountered" ;
/* WZAS_ARCHIVE_MUST_BE_LOADED_FOR_ADD */   "577" = "The directory for %1% is not completely loaded. Add operations require a completely loaded directory. Add failed\n" ;
/* WZAS_UNABLE_TO_PROCESS_LOCAL_HEADERS */  "578" = "Unable to process the local headers for %1%. The add operation failed.\n)" ;
/* WZAS_SPLITSIZE_TOO_SMALL */              "579" = "Invalid option: the specified split size is too small: %1%\n" ;
/* WZAS_MISSING_OPTICAL_DISK_BURNER */      "580" = "Invalid option: missing optical disk burner instance\n" ;

/* WZAS_MISSING_ENCRYPTION_PASSWORD */      "582" = "Invalid option: missing encryption password\n" ;
/* WZAS_MISSING_TEMP_PATH */                "583" = "Invalid option: write to optical media requires a temp path\n" ;
/* WZAS_ZIP_FILE_IS_READONLY */             "584" = "The Zip file you are trying to modify is read-only and cannot be updated: %1%\n" ;
/* WZAS_MISSING_LOCAL_HEADER */             "585" = "Unable to find the local header for %1%\n" ;
/* WZAS_UNEXPECTED_EOF_READING_LOCAL_HEADER */      "586" = "Unexpected end of file while processing local header for %1%" ;
/* WZAS_INVALID_LOCAL_HEADER */             "587" = "Invalid local header for %1% encountered" ;
/* WZAS_ARCHIVE_DOES_NOT_EXIST */           "588" = "Nothing to load: the file %1% does not exist\n" ;
/* WZAS_CRC_MISMATCH */                     "589" = "Central and local directory mismatch (crc-32 - local: %1% hex  central: %2% hex)" ;
/* WZAS_COMPRESSION_METHOD_MISMATCH */      "590" = "Central and local directory mismatch (compression method - local: %1%  central: %2%)" ;

/* WZAS_COMPRESSED_SIZE_MISMATCH */         "591" = "Central and local directory mismatch (compressed size - local: %1%  central: %2%)" ;
/* WZAS_UNCOMPRESSED_SIZE_MISMATCH */       "592" = "Central and local directory mismatch (uncompressed size - local: %1%  central: %2%)" ;
/* WZAS_GPFLAGS_MISMATCH */                 "593" = "Central and local directory mismatch (general purpose flags - local: %1% hex  central: %2% hex)" ;
/* WZAS_FILENAME_MISMATCH */                "594" = "Filename in local header doesn\'t match filename in central header. Using central header name." ;
/* WZAS_UNSUPPORTEDVERSION */               "595" = "%1% requires an unsupported zip compression scheme" ;
/* WZAS_TIMESTAMP_MISMATCH */               "596" = "Central and local directory mismatch (timestamp - local: %1%  central: %2%)" ;
/* WZAS_MADEBYVERSIONDDONSYSTEMTYPED */      "597" = "Made by version %1%.%2% on system type %3%: %4%" ;
/* WZAS_NEEDSUNZIPDDONSYSTEMTYPED */        "598" = "Needs unzip %1%.%2% on system type %3%: %4%" ;
/* WZAS_LOCALFLAGSXXCENTRALXX */            "599" = "Local GP flags = 0x%1%, central = 0x%2%: %3%" ;
/* WZAS_UNDEFINEDBITSUSEDINFLAGSXX */       "600" = "Undefined bits used in GP flags = 0x%1%: %2%" ;

/* WZAS_UNKNOWNCOMPRESSIONMETHODU */        "601" = "Unknown compression method %1%: %2%" ;
/* WZAS_STARTSONDISKU */                    "602" = "Starts in part %1%: %2%" ;
/* WZAS_UNKNOWNINTERNALATTRIBUTESXX */      "603" = "Unknown internal attributes = 0x%1%: %2%" ;
/* WZAS_UNKNOWNEXTERNALATTRIBUTESXLX */     "604" = "Unknown compression method %1%: %2%" ;
/* WZAS_UNABLE_TO_FIND_FILENAME */          "605" = "WinZip was unable to find \"%1%\" in the Zip file\n" ;
/* WZAS_ARCHIVE_MUST_BE_LOADED_FOR_EXTRACT */   "606" = "The archive has not been loaded.  Nothing to extract." ;
/* WZAS_ARCHIVE_EMPTY_NOTHING_TO_EXTRACT */     "607" = "The archive is empty.  Nothing to extract." ;
/* WZAS_NO_MATCHING_FILES_NOTHING_TO_EXTRACT */ "608" = "There are no matching files in the archive.  Nothing to extract." ;
/* WZAS_NOTENOUGHSPACE */                       "609" = "There is insufficient disk space on drive %1%, the new Zip file requires %2%K of disk space." ;
/* WZAS_COUNTINENDOFCENTRALDIRECTORYINCORRECT */    "610" = "the number of entries (%1%) in the central directory does not match the number of entries found (%2%)" ;

/* WZAS_MULTIPLEDISKINFORMATIONIGNORED */   "611" = "multiple disk information ignored" ;
/* WZAS_ZE_BAD_ZIP_ENTRY */                 "612" = "Unable to locate %1% in Zip file; Zip item does not exist, file name or path misspelled or contains invalid characters, or Zip file is corrupt." ;
/* WZAS_NAMENOTMATCHED */                   "613" = "no files were found for %1% that match your selection criteria." ;
/* WZAS_EXCL_NAMENOTMATCHED */              "614" = "no files were found for this exclude pattern based on your selection criteria: %1%" ;
/* WZAS_NAMEINZIPFILEREPEATED */            "615" = "name in Zip file repeated: %1%" ;
/* WZAS_FILETOOLARGE */                     "616" = "%1% is too big to be stored in a Zip file and will be skipped." ;
/* WZAS_UPTODATE */                         "617" = "Zip diagnostic %1% is up to date." ;
/* WZAS_MISSINGORBEFOREORAFTER */           "618" = "Zip diagnostic %1% missing or before or after" ;
/* WZAS_ZIP_TOOMANYFILES */                 "619" = "You are trying to create a Zip file containing %1% files which is more than the maximum number of files allowed." ;
/* WZAS_EXCLUDING */                        "620" = "Excluding %1%\n" ;

/* WZAS_INVALIDNAMENOTZIPPED */         "621" = "\"%1%\" is not a valid file name and was skipped" ;
/* WZAS_NAME_TOO_LONG */                "622" = "Name too long. Unable to add: %1%" ;
/* WZAS_EMPTYNAMEWITHOUTJ */            "623" = "empty name with store full path option specified" ;
/* WZAS_REPLACE_FILE_WITH_FOLDER */     "624" = "Unable to replace the file \"%1%\" with a folder: " ;
/* WZAS_REPLACE_FOLDER_WITH_FILE */     "625" = "Unable to replace the folder \"%1%\" with a file: " ;
/* WZAS_ZIPDIAGNOSTICEXCLUDINGSN */     "626" = "zip diagnostic: excluding %1%\n" ;
/* WZAS_ZE_READONLY */                  "627" = "The Zip file you are trying to modify is read-only and cannot be updated: %1%" ;
/* WZAS_ZE_READONLYMEDIA */             "628" =  "You are trying to create a new Zip file on a disk that is read-only: %1%" ;
/* WZAS_ZE_CREAT */                     "629" = "Could not create output file: %1%" ;
/* WZAS_ZE_GT4GB_OLD */                 "630" = "The old Zip file is larger than the maximum permitted size of a Zip file: %1%" ;

/* WZAS_ZE_NAME */                              "631" = "Missing or empty Zip file: %1%" ;
/* WZAS_ZE_TEMP */                              "632" = "Temporary file failure - possible cause: disk full or system limits exceeded: %1%" ;
/* WZAS_ZE_READ */                              "633" = "Input file read failure: %1%" ;
/* WZAS_ZE_WRITE */                             "634" = "Output file write failure - possible cause: disk full or system limits exceeded: %1%" ;
/* WZAS_ERRORWRITINGTOSPOSSIBLECAUSEDISKFULL */     "635" = "Error (%1%) writing to %2%.  Possible cause: disk full or system limits exceeded" ;
/* WZAS_UPDATINGS */                            "636" = "Updating %1%" ;
/* WZAS_DELETINGS */                            "637" = "Deleting %1%" ;
/* WZAS_WASZIPPINGS */                          "638" = "Was zipping %1%" ;
/* WZAS_COULDNOTOPENFORREADING */               "639" = "Could not open for reading: %1%" ;
/* WZAS_WILLJUSTCOPYENTRYOVER */                "640" = "Will just copy original entry: %1%" ;

/* WZAS_PRESERVING */                   "641" = "Preserving %1%" ;
/* WZAS_ADDINGS */                      "642" = "Adding %1%" ;
/* WZAS_WASCOPYINGS */                  "643" = "Was copying %1%" ;
/* WZAS_FILEOPENBYANOTHERPROGRAM */     "644" =  "The following file is open by another program.  If that program" ;
/* WZAS_FILEOPENBYANOTHERPROGRAM2 */    "645" = "  writes to the file while WinZip is zipping the file, the zipped" ;
/* WZAS_FILEOPENBYANOTHERPROGRAM3 */    "646" = "  file may be corrupt: %1%" ;
/* WZAS_ZE_NOAES */                     "647" = "Unable to encrypt the file using AES" ;
/* WZAS_AES_NO_PERFORMANCE_TIMER */     "648" = "High-performance timer support, required by WinZip for AES encryption, is not available on this computer" ;
/* WZAS_UNSUPPORTEDWAVEFILEUSINGBZIP2 */    "649" = "Note: this file is not a WAVPACK supported .WAV file format. Using bzip2 compression instead." ;
/* WZAS_UNSUPPORTEDJPEGFILEUSINGENHDEFL */  "650" = "Note: this file is not supported by JPEG compression. Using Enhanced Deflate instead." ;

/* WZAS_FILESIZECHANGEDWHILEZIPPING */          "651" = "The following file was not processed successfully:\n\n%1%\n\nThe original file size was %2% bytes but %3% bytes were available to WinZip while processing the file." ;
/* WZAS_ZIPNOTSUPPORTEDFORIOONPIPESORDEVICES */     "652" = "Zip (store) not supported for I/O on pipes or devices" ;
/* WZAS_INCORRECTCOMPRESSEDSIZE */              "653" = "Incorrect compressed size: expected=%1%, actual=%2%" ;
/* WZAS_WRITING_CDIR */                         "654" = "Writing central directory -- please wait..." ;
/* WZAS_ZE_GT4GB */                             "655" = "The new Zip file is larger than the maximum permitted size of a Zip file" ;
/* WZAS_ZIPCREATING */                          "656" = "Creating Zip file %1%" ;
/* WZAS_TOTALBYTESLUCOMPRESSEDLUDSAVINGSN */    "657" = "Total bytes=%1%, Compressed=%2% -> %3% percent savings\n" ;
/* WZAS_REPLACENODISKSPACE */                   "658" = "Replace: there was insufficient disk space for %1%" ;
/* WZAS_REPLACECOULDNOTMOVE */                  "659" = "Replace: unable to move %1%" ;
/* WZAS_REPLACECOULDNOTRENAME */                "660" = "Replace: could not rename %1%" ;

/* WZAS_REPLACINGOLD */                     "661" = "Replacing old Zip file %1%" ;
/* WZAS_ZIPCOPYING */                       "662" = "Copying Zip file %1%" ;
/* WZAS_REPLACECANTOPEN */                  "663" = "Replace: can\'t open %1%" ;
/* WZAS_COULDNOTREPLACEORIGINALZIPFILENEWZIPLEFTASS */  "664" = "Could not replace original Zip file!  New Zip left as %1%" ;
/* WZAS_INSERTNEWDISKETTE */                "665" = "Please insert disk number %1% of the spanned Zip file into drive %2%" ;
/* WZAS_FORMATSTATUS */                     "666" = "Formatting Drive %1%" ;
/* WZAS_WIPESTATUS */                       "667" = "Erasing Files on Drive %1%" ;
/* WZAS_LARGE_FILE_GUI_WARNING */           "668" = "The size of \"%1%\" exceeds the maximum file size of 4 gigabytes allowed by the Zip 2.0 file format.\n\nThis file will be skipped." ;
/* WZAS_SPLITTING_ONLY_WITH_ADD */          "669" = "Splitting can only be specified for Add operations" ;
/* WZAS_SPLITTING_AND_SPANNING */           "670" = "Spanning and splitting can not be specified for the same operation" ;

/* WZAS_UNSUPPORTED_ENCRYPTION_REQUESTED */ "671" = "The requested encryption method (%1%) is not supported" ;
/* WZAS_SYSTEM_ERROR */                     "672" = "System error: %1%" ;
/* WZAS_CANNOT_FIND_FILE */                 "673" = "WinZip was unable to find \"%1%\" in the Zip file\n" ;
/* WZAS_DOSDATETIMEFAILED */                "674" = "DosDateTime failed: %1%" ;
/* WZAS_COULDNOTSETFILEATTRIBUTES */        "675" = "Could not set file attributes (1%)" ;
/* WZAS_CANNOT_CREATE_PATH */               "676" = "Path doesn\'t exist; not allowed to create: %1%" ;
/* WZAS_EXTRACTING */                       "677" = "Extracting %1%" ;
/* WZAS_TESTING */                          "678" = "Testing %1%" ;
/* WZAS_CDIR_ENCRYPTED */                   "679" = "This Zip file has an encrypted central directory which is not supported" ;
/* WZAS_CDIR_UNSUPPORTED */                 "680" = "The end of central directory record is not in a supported format.\n Please see www.winzip.com/zip2.htm for more information.\n   Version needed value for this file is %1%.\n" ;

/* WZAS_AES_MISMATCH */                 "681" = "The central and local directory AES extra data do not match" ;
/* WZAS_MULTIPLE_PARTS_DISALLOWED */    "682" = "Unsupported request for multi-part Zip file" ;
/* WZAS_ZE_FORMAT */                    "683" = "Input file %1% has invalid format" ;
/* WZAS_CANT_REMOVE_DIRECTORY_WARN */   "684" = "Unable to remove directory \"%1%\"" ;
/* WZAS_CANT_REMOVE_FILE_WARN */        "685" = "Unable to remove file \"%1%\"" ;
/* WZAS_MOVING_FILES */                 "686" = "Moving Files..." ;
/* WZAS_ZIPFILE_DATE_ONLY_DIRS */       "687" = "Zip file has only directories, can\'t make it as old as latest entry" ;
/* WZAS_BADCRC */                       "688" = "CRC check failed. Expected %1%, actual %2%\n" ;
/* WZAS_AUTHENTICATION_FAILED */        "689" = "Unable to authenticate file. Either the Zip file has been damaged or the password is incorrect." ;
/* WZAS_COMPRESSED_LARGER_STORING */    "690" = "Note: this file is not compressible. Storing." ;

/* WZAS_ERRORS_INFO */                  "691" = "%1% (%2%)\n" ;
/* WZAS_NOTHING_TO_DO */                "692" = "No files were found for this operation - Nothing to do." ;

/*
 * End of ZipFile strings
 */



/*
 * Cloud Service Operations strings
 */

/*kNoCloudServiceAvialableMessageText*/            "kNoCloudServiceAvialableMessageText" = "Need to be logged into a Cloud Service to use this feature.";
/*kNoCloudServiceAvialableInformativeText*/        "kNoCloudServiceAvialableInformativeText" = "Please log into at least one cloud service account on the Preferences page.";

/*kUpdateAccountInfoFailed*/           "kUpdateAccountInfoFailed" = "Loading files for %@ failed.";

/*kCloudServiceAccountInfoIsLoading*/   "Display this string when user had login in preferences,but information of the account is not loaded." = "Loading files.";

/*kCloudServiceLoginErrorOccurred*/     "A error occurred when login cloud service,this is warning alert\'s message text." = "The service returned an error while logging in";
/*kCloudServiceLoginError*/             "A error occurred when login cloud service,this is warning alert\'s informative text format string." = "Error message information:%@";

/*kCloudServiceCannotLogoutMessageText*/           "MessageText of warning alert for cloud service can not logout right now" = "Unable to log out";
/*kCloudServiceCannotLogoutInformativeText*/       "InformativeText of warning alert for cloud service can not logout right now" = "You cannot log out of %@ until all downloads and uploads are completed. Please retry after %@ is finished.";

/*kCloudZipFileSaveReminderMessageTextFormat*/            "kCloudZipFileSaveReminderMessageTextFormat" = "Do you want to save the changes that you have made?";
/*kCloudZipFileSaveReminderSaveButtonTitle*/        "kCloudZipFileSaveReminderSaveButtonTitle" = "Save";
/*kCloudZipFileSaveReminderCancelButtonTitle*/      "kCloudZipFileSaveReminderCancelButtonTitle" = "Stop";
/*kCloudZipFileSaveReminderDoNotSaveButtonTitle*/   "kCloudZipFileSaveReminderDoNotSaveButtonTitle" = "Don\'t Save";
/*kCloudZipFileSaveReminderInformativeTextFormat*/  "kCloudZipFileSaveReminderInformativeTextFormat" = "The file \"%@\" in %@ has been modified. Your changes will be lost if you don\'t save them.";
/*kCloudZipFileSaveReminderWindowTitle*/            "kCloudZipFileSaveReminderWindowTitle" = "Save";

/*kPickerNewFolderDefaultUntitledName*/             "kPickerNewFolderDefaultUntitledName" = "untitled folder";


//--rename items error alerts--\\

/*kRenameFileRepetitiveNameAlertMessageText*/                   "kRenameFileRepetitiveNameAlertMessageText" = "The name is already taken";
/*kRenameFileRepetitiveNameAlertInformativeTextFormat*/         "kRenameFileRepetitiveNameAlertInformativeTextFormat" = "The file name \"%@\" is already taken. Please choose a different name.";

/*kRenameFolderRepetitiveNameAlertMessageText*/                 "kRenameFolderRepetitiveNameAlertMessageText" = "The name is already taken";
/*kRenameFolderRepetitiveNameAlertInformativeTextFormat*/       "kRenameFolderRepetitiveNameAlertInformativeTextFormat" = "The folder name \"%@\" is already taken. Please choose a different name.";

/*kRenameFileInvalidNameAlertMessageText*/                      "kRenameFileInvalidNameAlertMessageText" = "Invalid name";
/*kRenameFileInvalidNameAlertInformativeTextFormat*/            "kRenameFileInvalidNameAlertInformativeTextFormat" = "The file name \"%@\" is invalid. Please choose a different name.";

/*kRenameFolderInvalidNameAlertMessageText*/                    "kRenameFolderInvalidNameAlertMessageText" = "Invalid name";
/*kRenameFolderInvalidNameAlertInformativeTextFormat*/          "kRenameFolderInvalidNameAlertInformativeTextFormat" = "The folder name \"%@\" is invalid. Please choose a different name.";


//--internael error alerts--\\

/*kInternalErrorAlertMessageText*/                              "kInternalErrorAlertMessageText" = "WinZip returned an error";
/*kInternalErrorAlertInformativeTextFormat*/                    "kInternalErrorAlertInformativeTextFormat" = "Error message information: %@.";


//--move items alert error alerts--\\

/*kMoveItemsErrorAlertMessageText*/                             "kMoveItemsErrorAlertMessageText" = "The file or folder name is already taken in the target folder";
/*kMoveItemsErrorAlertInformativeText*/                         "kMoveItemsErrorAlertInformativeText" = "There is a file or folder item with the same name exists in the target folder. Please check the target folder and retry again.";


//--cloud service unknown error alerts--\\

/*kUnknownErrorMessageText*/                                    "kUnknownErrorMessageText" = "Unknown error";
/*kUnknownErrorInformativeTextFormat*/                          "kUnknownErrorInformativeTextFormat" = "%@";


//--new folder error alerts--\\

/*kNewFolderNameAlreadyTakenMessageText*/                       "kNewFolderNameAlreadyTakenMessageText" = "The name is already taken";
/*kNewFolderNameAlreadyTakenInformativeTextFormat*/             "kNewFolderNameAlreadyTakenInformativeTextFormat" = "The folder name \"%@\" is already taken. Please choose a different name.";
/*kNewFolderUnspportMessageText*/                               "kNewFolderUnspportMessageText" = "Cannot create a new folder";
/*kNewFolderUnspportInformativeTextFormat*/                     "kNewFolderUnspportInformativeTextFormat" = "%@ does not allow new folders to be created in the root.";


//--mail tail--\\

/*kMailTailForOSX7AndEarlierFormat*/                "kMailTailForOSX7AndEarlierFormat" = "A file was sent to you using WinZip, the best way to zip/unzip files.\nGo to %@ to download WinZip now.\n\r";
/*kMailTailForOSX8AndLater*/                        "kMailTailForOSX8AndLater" = "A file was sent to you using WinZip, the best way to zip/unzip files.";
/*kMailTailForOSX8AndLaterTheLinkString*/           "kMailTailForOSX8AndLaterTheLinkString" = "Download WinZip Now";

/*kMailTailLinkURL*/                                "kMailTailLinkURL" = "http://www.winzip.com";
/*kMailTailShortLinkURL*/                           "kMailTailShortLinkURL" = "http://www.winzip.com";

//--adding files occurred duplicate item error alerts--\\
/*kAddingFilesDuplicateItemAlertMessageText*/                   "kAddingFilesDuplicateItemAlertMessageText" = "Duplicate item found";
/*kAddingFilesDuplicateItemAlertInformativeTextFormat*/         "kAddingFilesDuplicateItemAlertInformativeTextFormat" = "An item named \"%@\" already exists in this path. Do you want to replace it with the one you're adding?";

/*
 * End of Cloud Service Operations strings
 */

//Save To Mac Operation String
"kSaveFileNoPermissionErrorFormat" = "“%@“ couldn’t be saved because you don’t have permission to access “%@”.";

